IDEA StatiCa Open Model
Region2D.Outline Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the outline curve of Region2D.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PolyLine2D Outline { get; set; }
Public Property Outline As PolyLine2D
	Get
	Set
public:
property PolyLine2D^ Outline {
	PolyLine2D^ get ();
	void set (PolyLine2D^ value);
}
Property Value
Type: PolyLine2D
See Also
Reference
Region2D Class
IdeaRS.OpenModel.Geometry2D Namespace